export const DUMMY_STOCK_TO_ID = {
  삼성전자: "005930",
  SK하이닉스: "000660",
};

export const DUMMY_ID_TO_STOCK = {
  "005930": "삼성전자",
  "000660": "SK하이닉스",
};

export const DUMMY_KEYWORDS = {
  "005930": [
    "스마트폰",
    "반도체",
    "텔레비전",
    "가전제품",
    "디스플레이",
    "인공지능",
    "모바일",
    "전자제품",
    "경쟁사",
    "혁신",
    "노트북",
    "전자기기",
    "소프트웨어",
    "하드웨어",
    "디지털",
    "미래기술",
    "글로벌기업",
    "투자",
    "산업",
    "혁신력",
  ],
  "000660": [
    "반도체",
    "메모리",
    "스토리지",
    "플래시",
    "낸드",
    "기술",
    "데이터",
    "인텔리전스",
    "제조",
    "경쟁사",
    "시장",
    "디자인",
    "혁신",
    "연구",
    "전자",
    "투자",
    "성능",
    "미래",
    "협력",
    "글로벌",
  ],
};

export const DUMMY_NEWS = [
  {
    title: "마법의 대회: 공중에 떠다니는 마법 보드 위의 격투",
    detail:
      "오늘은 마법사들이 모여 마법의 대회를 열었어요. 그들은 공중에 떠다니는 마법 보드를 타고 서로의 마법 실력을 겨루었죠. 한 마법사는 별빛을 모아 크게 빛나는 별을 만들었고, 다른 마법사는 시간을 되돌리는 시계를 조종했어요. 나는 그들의 경기를 지켜보며 마법의 힘이 얼마나 멋진지 감탄했어요.",
  },
  {
    title: "우주선 타고 떠나는 모험: 신비로운 푸른 행성의 발견",
    detail:
      "어느 날, 우주선이 지구를 방문했어요. 그들은 우리에게 새로운 행성을 발견했다고 말했어요. 행성은 푸른 바다와 녹색 숲, 그리고 분홍색 구름으로 뒤덮여 있었어요. 그들은 우리를 그 행성으로 초대했고, 나는 행복하게 그들의 초대를 받아들였어요. 함께 우주선을 타고 그 행성을 탐험하는 모험을 시작했죠.",
  },
  {
    title: "꿈 속의 이야기: 무지개색 고양이와의 모험",
    detail:
      "꿈 속에서 나는 무지개색 고양이를 만났어요. 그는 하늘을 날아다니며 나를 초대했고, 함께 구름 위를 달리며 모험을 시작했어요. 우리는 달과 별을 뛰어넘고, 마법의 숲을 헤치며 많은 친구들을 만났죠. 마침내, 깨어나게 되었지만 그 모험은 아직도 내 꿈 속에 살아있어요.",
  },
  {
    title: "바닷가의 소리: 파도와 바람의 노래",
    detail:
      "바닷가에 서면 파도와 바람의 노래가 내 귓가를 간지럽혔어요. 햇살이 푸른 바다 위를 반짝이며 빛나고, 작은 모래알들이 발밑에서 춤을 추었어요. 나는 시간을 잊고 파도와 함께 춤을 췄고, 바람의 속삭임에 귀 기울였어요. 이곳은 마치 시간이 멈춘 듯한 곳이었어요.",
  },
];
